URLShortener/app/models/shortened_url.rb

  def self.random_code
    unique = false
    until unique == true
      s_url = SecureRandom.urlsafe_base64
      unique = true unless ShortenedUrl.exists?(short_url: s_url)
---
SELECT  1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "EEajPJyw5G-xUxyl_Ka7Ow"], ["LIMIT", 1]]

  def self.generate_url(user, long_url)
    ShortenedUrl.create!(short_url: ShortenedUrl.random_code, long_url: long_url,user_id: user.id)
---
INSERT INTO "shortened_urls" ("long_url", "short_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["long_url", "www.a.com"], ["short_url", "EEajPJyw5G-xUxyl_Ka7Ow"], ["user_id", 2], ["created_at", "2019-03-28 00:04:06.329004"], ["updated_at", "2019-03-28 00:04:06.329004"]]